<?php

return array(

	'category' => 'பிரிவு',
	'categories' => 'பிரிவுகள்',

	'create_category' => 'புதியதொரு பிரிவை உருவாக்குங்கள்',
	'edit_category' => '&ldquo;%s&rdquo; தொகுக்கப்படுகின்றது',

	// form fields
	'title' => 'தலைப்பு',
	'title_explain' => 'உங்கள் பிரிவின் தலைப்பு.',
	'title_missing' => 'தயவுசெய்து ஒரு தலைப்பை உள்ளிடுங்கள்',

	'slug' => 'அடி',
	'slug_explain' => 'உங்கள் பிரிவிற்கான அடி.',

	'description' => 'விபரம்',
	'description_explain' => 'உங்கள் பிரிவு எதனைப்பற்றியது.',

	// messages
	'created' => 'உங்கள் புதிய பிரிவு சேர்க்கப்பட்டுவிட்டது.',
	'updated' => 'உங்கள் பிரிவு மேம்படுத்தப்பட்டுவிட்டது.',
	'deleted' => 'உங்கள் பிரிவு நீக்கப்பட்டுவிட்டது.',
	'delete_error' => 'உங்களிடம் ஆகக்குறைந்தது ஒரு பிரிவாயினும் இருத்தல் வேண்டும்.',

);