<?php

return array(

	'users' => 'பயனர்கள்',

	'create_user' => 'ஒரு புதிய பயனரை உருவாக்கு',
	'add_user' => 'ஒரு புதிய பயனரை சேர்',
	'editing_user' => '%s&rsquo;s இன் சுயவிபரம் தொகுக்கப்படுகின்றது',
	'remembered' => 'எனக்கு எனது கடவுச்சொல் தெரியும்',
	'forgotten_password' => 'கடவுச்சொல்லை மறந்து விட்டீர்களா?',

	// roles
	'administrator' => 'நிருவாகி',
	'administrator_explain' => '',

	'editor' => 'பதிப்பாசிரியர்',
	'editor_explain' => '',

	'user' => 'பயனர்',
	'user_explain' => '',

	// form fields
	'real_name' => 'உண்மையான பெயர்',
	'real_name_explain' => '',

	'bio' => 'சுயவிபரம்',
	'bio_explain' => '',

	'status' => 'நிலை',
	'status_explain' => '',

	'role' => 'வகிபங்கு',
	'role_explain' => '',

	'username' => 'பயனர்பெயர்',
	'username_explain' => '',
	'username_missing' => 'தயவுசெய்து ஒரு பயனர்பெயரை உள்ளிடுங்கள், அது கட்டாயம் %s எழுத்துக்களை கொண்டிருக்க வேண்டும்',

	'password' => 'கடவுச்சொல்',
	'password_explain' => '',
	'password_too_short' => 'கடவுச்சொல் ஆகக்குறைந்தது %s எழுத்துக்களை கொண்டிருக்க வேண்டும்',

	'new_password' => 'புதிய கடவுச்சொல்',

	'email' => 'மின்னஞ்சல்',
	'email_explain' => '',
	'email_missing' => 'தயவுசெய்து ஒரு சரியான மின்னஞ்சலை உள்ளிடுங்கள்',
	'email_not_found' => 'சுயவிபரம் காணப்படவில்லை.',

	// messages
	'updated' => 'பயனர் சுயவிபரம் மேம்படுத்தப்பட்டது.',
	'created' => 'பயனர் சுயவிபரம் உருவாக்கப்பட்டுவிட்டது.',
	'deleted' => 'பயனர் சுயவிபரம் நீக்கப்பட்டுவிட்டது.',
	'delete_error' => 'நீங்கள் உங்கள் கணக்கை நீக்க முடியாது',
	'login_error' => 'பயனர்பெயர் அல்லது கடவுச்சொல் தவறானது.',
	'logout_notice' => 'நீங்கள் இப்போது வெளியேறிவிட்டீர்கள்.',
	'recovery_sent' => 'உங்கள் கடவுச்சொல் மாற்றத்தை உறுதிப்படுத்த, நாங்கள் உங்களுக்கு ஒரு மின்னஞ்சல் அனுப்பியுள்ளோம்.',
	'recovery_expired' => 'கடவுச்சொல்லை மாற்றுவதற்கான நேரம் முடிவடைந்துவிட்டது, தயவுசெய்து மீள முயற்சியுங்கள்.',
	'password_reset' => 'உங்கள் புதிய கடவுச்சொல் மாற்றப்பட்டுவிட்டது. இப்போது நீங்கள் உள்நுழையலாம்!',

	// password recovery email
	'recovery_subject' => 'கடவுச்சொல்லை மாற்று',
	'recovery_message' => 'நீங்கள் உங்கள் கடவுச்சொல்லை மாற்ற விண்ணப்பித்துள்ளீர்கள்.' .
		'தொடர்வதற்கு கீழுள்ள தொடுப்பை சொடுக்குங்கள்.' . PHP_EOL . '%s',

);